fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиентов/ВКМ_ОбслуживаниеКлиентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ОбслуживаниеКлиентов</name>
  <registerRecords>AccumulationRegister.ВКМ_ВыполенныеКлиентуРаботы</registerRecords>
  <attributes>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Специалист</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПроведенияРабот</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяНачалаРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяОкончанияРаботПлан</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеПроблемы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВыполенныеРаботы</name>
    <attributes>
      <name>ОписаниеРабот</name>
      <type>
        <types>CatalogRef.РаботыПоАбонентскомуДоговору</types>
      </type>
    </attributes>
    <attributes>
      <name>ФактическиПотраченоЧасов</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЧасыКОплатеКлиенту</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/AccumulationRegisters/ВКМ_ВыполенныеКлиентуРаботы/ВКМ_ВыполенныеКлиентуРаботы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВыполенныеКлиентуРаботы</name>
  <resources>
    <name>КоличествоЧасов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаКОплате</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Клиент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Documents/ВКМ_ОбслуживаниеКлиентов/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ,Режим)

	Движения.ВКМ_ВыполенныеКлиентуРаботы.Записывать = Истина;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Клиент КАК Клиент,
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Договор КАК Договор,
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Договор.ВКМ_СтоимостьЧасаРабот КАК СтоимостьЧасаРабот,
	|	СУММА(ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.ЧасыКОплатеКлиенту) КАК ЧасыКОплатеКлиенту,
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Договор.ВКМ_ДатаНачалаДоговора КАК ДоговорВКМ_ДатаНачалаДоговора,
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Договор.ВКМ_ДатаОкончанияДоговора КАК
	|		ДоговорВКМ_ДатаОкончанияДоговора,
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Договор.ВидДоговора КАК ДоговорВидДоговора,
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Дата КАК Дата
	|ИЗ
	|	Документ.ВКМ_ОбслуживаниеКлиентов.ВыполенныеРаботы КАК ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы
	|ГДЕ
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Клиент,
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Договор,
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Договор.ВКМ_СтоимостьЧасаРабот,
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Договор.ВКМ_ДатаНачалаДоговора,
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Договор.ВКМ_ДатаОкончанияДоговора,
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Договор.ВидДоговора,
	|	ВКМ_ОбслуживаниеКлиентовВыполенныеРаботы.Ссылка.Дата";
	
	 Запрос.УстановитьПараметр("Ссылка", Ссылка);
	 Выборка = Запрос.Выполнить().Выбрать();
	 
	 Пока Выборка.Следующий() Цикл
	 	Если Выборка.ДоговорВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
	 		Отказ = Истина;
	 		Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "У договора проставлен вид не Абонентское обслуживание.";
			Сообщение.Сообщить();
	 	КонецЕсли;
	 	
	 	Если  Выборка.Дата < Выборка.ДоговорВКМ_ДатаНачалаДоговора Тогда
	 		Отказ = Истина;
	 		Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Дата начала договора больше, чем дата документа";
			Сообщение.Сообщить();
	 	КонецЕсли;
	 	
	 	Если Выборка.Дата > Выборка.ДоговорВКМ_ДатаОкончанияДоговора Тогда
	 		Отказ = Истина;
	 		Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Дата окончания договора меньше, чем дата документа";
			Сообщение.Сообщить();
	 	КонецЕсли;
		 		
		 	Движение = Движения.ВКМ_ВыполенныеКлиентуРаботы.Добавить();
			Движение.Период = Дата;
			Движение.Клиент = Выборка.Клиент;
			Движение.Договор = Выборка.Договор;
			Движение.КоличествоЧасов = Выборка.ЧасыКОплатеКлиенту;
			Движение.СуммаКОплате = Выборка.ЧасыКОплатеКлиенту * Выборка.СтоимостьЧасаРабот;
	 
	 КонецЦикла;
	
КонецПроцедуры
